IDEA Open Model
OpeningRect Class
Compatible with IDEA StatiCa Beta 20.0
 Representation of rectangular opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.OpeningRect
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class OpeningRect : Opening
Public Class OpeningRect
	Inherits Opening
The OpeningRect type exposes the following members.
Constructors
Name | Description
OpeningRect
 Constructor
Top
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
 (Inherited from Opening.)
Height
 Height of wall
Id
 Element Id
 (Inherited from OpenElementId.)
InsertPoint
 Insert point 0 - 9
 (Inherited from Opening.)
MasterComponent
 Master component
 (Inherited from Opening.)
MasterPoint
 Master point 0 - 9
 (Inherited from Opening.)
Name
 Name
 (Inherited from Opening.)
Outline
 Outline of Oopening
 (Inherited from Opening.)
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
 (Inherited from Opening.)
Width
 Width of wall
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace